{"version":"https://jsonfeed.org/version/1","title":"faith.rodeo","items":[{"id":"https://faith.rodeo/posts/how-to-be.html","url":"https://faith.rodeo/posts/how-to-be.html","title":"How To Be","content_html":"<p>“If only I just had two weeks to myself where I could have full control over my life, then I know I could get everything back under my thumb.” This is a thought I remember having several times to myself only weeks before just that happened. Everything shut down. It was just me, a bedroom, and what could be infinite time. Take it from me, stacked time may have its potential, but time was never the problem to begin with.</p>\n","content_text":null,"date_published":"Wed, 15 Apr 2020 17:00:00 +0100","tags":[]},{"id":"https://faith.rodeo/posts/havoc-students-wreak-upon-themselves.html","url":"https://faith.rodeo/posts/havoc-students-wreak-upon-themselves.html","title":"The Havoc Students Wreak Upon Themselves","content_html":"<p>For the first time in eight months, students are finding themselves in a situation unlike anything they’ve experienced in a long time. Many have been working relentlessly for days or weeks on end, meeting tight, short-term deadlines, tests, due-dates and whatever else their teachers can throw their way. We all keep ourselves quite busy during the year. It’s tiring, and it never stops. That is, until the global economy shuts down due to a looming pandemic. That’s when things start to get a little… weird.</p>\n","content_text":null,"date_published":"Wed, 15 Apr 2020 16:00:00 +0100","tags":[]},{"id":"https://faith.rodeo/posts/hello-from-a-broken-world.html","url":"https://faith.rodeo/posts/hello-from-a-broken-world.html","title":"Hello From a Broken World","content_html":"<p>The end of humanity as we know it is nigh. Hundreds of years of dominance and torture aimed at our own “beloved” home has come to an end. In such trying times, our own miniscule place not only in the cosmos but also in our very own planet has become astonishingly clear. Within us all is the  endemic belief that humans are the ultimate species yet in the words of Shakespeare, man is the “quintessence of dust.” despite our extraordinarily noble outlook on our position in the world, we are but meager dust—noblesse self imposed.</p>\n","content_text":null,"date_published":"Wed, 15 Apr 2020 15:00:00 +0100","tags":[]}],"home_page_url":"https://faith.rodeo","description":"A group of people who, on occasion, have a thing or two to say"}